IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI-SERIES.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N            PIC 9(4) VALUE 10.
01 COUNTER      PIC 9(4) VALUE 3.
01 FIRST-NUM    PIC 9(18) VALUE 0.
01 SECOND-NUM   PIC 9(18) VALUE 1.
01 NEXT-TERM    PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "FIBONACCI SERIES: "
    DISPLAY FIRST-NUM
    DISPLAY SECOND-NUM
    
    PERFORM UNTIL COUNTER > N
        ADD FIRST-NUM TO SECOND-NUM GIVING NEXT-TERM
        DISPLAY NEXT-TERM
        MOVE SECOND-NUM TO FIRST-NUM
        MOVE NEXT-TERM TO SECOND-NUM
        ADD 1 TO COUNTER
    END-PERFORM
    
    STOP RUN.
